In [44]:
import numpy as np
import pandas as pd

In [45]:
df=pd.read_csv('data.csv')

In [46]:
df.columns

Index(['Unnamed: 0', 'Institute', 'Academic Program Name', 'Quota',
       'Seat Type', 'Gender', 'Opening Rank', 'Closing Rank', 'Year', 'Round'],
      dtype='object')

In [47]:
df.dtypes

Unnamed: 0                int64
Institute                object
Academic Program Name    object
Quota                    object
Seat Type                object
Gender                   object
Opening Rank             object
Closing Rank             object
Year                      int64
Round                     int64
dtype: object

In [48]:
df.describe()

         Unnamed: 0          Year         Round
count  89436.000000  89436.000000  89436.000000
mean   44717.500000   2019.478868      3.822778
std    25818.093675      1.861970      1.822341
min        0.000000   2016.000000      1.000000
25%    22358.750000   2018.000000      2.000000
50%    44717.500000   2020.000000      4.000000
75%    67076.250000   2021.000000      5.000000
max    89435.000000   2022.000000      7.000000

In [49]:
df.shape

(89436, 10)

In [50]:
df=df[[ 'Institute', 'Academic Program Name', 'Quota',
       'Seat Type', 'Gender', 'Opening Rank', 'Closing Rank', 'Year', 'Round']].copy()

In [51]:
df[['Quota']]

      Quota
0        AI
1        AI
2        AI
3        AI
4        AI
...     ...
89431    AI
89432    AI
89433    AI
89434    AI
89435    AI

[89436 rows x 1 columns]

In [52]:
df['Quota'].str.contains('AI').sum()

89436

In [53]:
df=df.drop('Quota',axis=1)

In [54]:
df.isna().sum()

Institute                    0
Academic Program Name        0
Seat Type                    0
Gender                   15285
Opening Rank                 0
Closing Rank                 0
Year                         0
Round                        0
dtype: int64

In [55]:
df.head()

,Institute,Academic Program Name,Seat Type,Gender,Opening Rank,Closing Rank,Year,Round
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,NaN,3533.0,5947.0,2016,1
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,NaN,1829.0,2213.0,2016,1
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",SC,NaN,663.0,1023.0,2016,1
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",ST,NaN,331.0,357.0,2016,1
4,Indian Institute of Technology Bhubaneswar,Civil Engineering and M. Tech. in Structural E...,OPEN,NaN,5408.0,6561.0,2016,1

In [56]:
df['Gender']

0                                          NaN
1                                          NaN
2                                          NaN
3                                          NaN
4                                          NaN
                         ...
89431    Female-only (including Supernumerary)
89432                           Gender-Neutral
89433    Female-only (including Supernumerary)
89434                           Gender-Neutral
89435    Female-only (including Supernumerary)
Name: Gender, Length: 89436, dtype: object

In [57]:
df['Gender']=df['Gender'].fillna('Gender-Neutral')

In [58]:
df.dtypes

Institute                object
Academic Program Name    object
Seat Type                object
Gender                   object
Opening Rank             object
Closing Rank             object
Year                      int64
Round                     int64
dtype: object

In [59]:
df=df.assign(Preparatory=False)

In [60]:
df['Opening Rank'].str.contains('P').sum()

4910

In [61]:
df.loc[df['Opening Rank'].str.contains('P'),'Preparatory']=True

In [63]:
df['Preparatory'].sum()

4910

In [65]:
df['Opening Rank']=df['Opening Rank'].str.replace('P',(''))

In [66]:
df['Closing Rank']=df['Closing Rank'].str.replace('P',(''))

In [67]:
df['Closing Rank']=pd.to_numeric(df['Closing Rank'])

In [68]:
df['Opening Rank']=pd.to_numeric(df['Opening Rank'])

In [74]:
df.dtypes

Institute                object
Academic Program Name    object
Seat Type                object
Gender                   object
Opening Rank              int64
Closing Rank              int64
Year                      int64
Round                     int64
Preparatory                bool
dtype: object

In [71]:
df['Closing Rank']=df['Closing Rank'].apply(np.int64)

In [73]:
df['Opening Rank']=df['Opening Rank'].apply(np.int64)

In [75]:
df.head()

,Institute,Academic Program Name,Seat Type,Gender,Opening Rank,Closing Rank,Year,Round,Preparatory
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,3533,5947,2016,1,False
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,1829,2213,2016,1,False
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",SC,Gender-Neutral,663,1023,2016,1,False
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",ST,Gender-Neutral,331,357,2016,1,False
4,Indian Institute of Technology Bhubaneswar,Civil Engineering and M. Tech. in Structural E...,OPEN,Gender-Neutral,5408,6561,2016,1,False

In [76]:
df.isna().sum()

Institute                0
Academic Program Name    0
Seat Type                0
Gender                   0
Opening Rank             0
Closing Rank             0
Year                     0
Round                    0
Preparatory              0
dtype: int64

In [79]:
df=df.assign(Institute_type='GFTI')

In [80]:
df.head()

,Institute,Academic Program Name,Seat Type,Gender,Opening Rank,Closing Rank,Year,Round,Preparatory,Institute_type
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,3533,5947,2016,1,False,GFTI
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,1829,2213,2016,1,False,GFTI
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",SC,Gender-Neutral,663,1023,2016,1,False,GFTI
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",ST,Gender-Neutral,331,357,2016,1,False,GFTI
4,Indian Institute of Technology Bhubaneswar,Civil Engineering and M. Tech. in Structural E...,OPEN,Gender-Neutral,5408,6561,2016,1,False,GFTI

In [81]:
df.loc[df['Institute'].str.contains('Indian Institute of Technology'),'Institute_type']='IIT'

In [82]:
df.head()

,Institute,Academic Program Name,Seat Type,Gender,Opening Rank,Closing Rank,Year,Round,Preparatory,Institute_type
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,3533,5947,2016,1,False,IIT
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,1829,2213,2016,1,False,IIT
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",SC,Gender-Neutral,663,1023,2016,1,False,IIT
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",ST,Gender-Neutral,331,357,2016,1,False,IIT
4,Indian Institute of Technology Bhubaneswar,Civil Engineering and M. Tech. in Structural E...,OPEN,Gender-Neutral,5408,6561,2016,1,False,IIT

In [84]:
df['Institute'].str.contains('National Institute of Technology').sum()

0

In [85]:
df.to_csv('final.csv')

In [86]:
df.head()

,Institute,Academic Program Name,Seat Type,Gender,Opening Rank,Closing Rank,Year,Round,Preparatory,Institute_type
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,3533,5947,2016,1,False,IIT
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,1829,2213,2016,1,False,IIT
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",SC,Gender-Neutral,663,1023,2016,1,False,IIT
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",ST,Gender-Neutral,331,357,2016,1,False,IIT
4,Indian Institute of Technology Bhubaneswar,Civil Engineering and M. Tech. in Structural E...,OPEN,Gender-Neutral,5408,6561,2016,1,False,IIT